Revit 2026 API

# ItemData Properties

---

The ItemData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The internal name of the item. |
|  | ToolTip | The tooltip of item. |

#### Reference

ItemData Class

Autodesk.Revit.UI Namespace